Repository: giellalt/corpus-sme
Catalog: prestable/tmx/nob2sme/facta/skuvlahistorja4/kirsten-s.htm.tmx
Source language: sme
Languages: nob

source: Doppe ožžon riskku , guokte liinni ja guokte gávtti .
nob: Der fikk jeg ny risku [ 1 ] og to liidni [ 2 ] og to kofter .

source: In ipmirdan manne ožžon guokte gávtti , liinni ja ulloliinni .
nob: Jeg skjønte ikke hvorfor jeg fikk to kofter , liidni og ull-liidni .

source: Adde munnje goikkehiid ja bittuid vel .
nob: Det ble også ordnet med skaller og bellinger .

source: Mu mielas lei dat olles ávvu .
nob: Jeg syntes det var stas .

source: Go ledjen orron doppe moadde beaivvi , de ipmirdin ahte mun galgen vuolgit .
nob: Etter å ha vært der noen dager gikk det opp for meg jeg at jeg skulle reise .

source: De čirron jaskadit .
nob: Da gråt jeg stille .

source: Boarrásiidruovttus lei bealjehis nissonolmmoš man namma lei Bolette , maŋŋil náitalan Westavikan .
nob: På gamlehjemmet jobbet en døv kvinne som het Bolette , senere gift Westavik .

source: Son basai ja divššui boarrásiid doppe .
nob: Hun vasket og stelte for de eldre der .

source: Bolette orui dušše moadde jagi Guovdageainnus , de son fárrii Troandimii .
nob: Bolette bodde bare et par år i Kautokeino og senere flyttet hun til Trondheim .

source: Son lei vázzán bealjehemiid skuvlla ja sus ledje govat dan áiggis go konfirmerejuvvui doppe .
nob: Hun hadde gått på døveskolen og hadde bilder fra da hun ble konfirmert der .

source: Oidnen ahte son máhtii čájehansániid .
nob: Jeg så at hun brukte tegn .

source: Son muitalii son lei bealjeheapmi nu go mun ja lei vázzán bealjehemiid skuvlla .
nob: Hun fortalte at hun var døv slik som meg og hadde gått på døveskolen .

source: Ipmirdin maid son amas olmmoš muitalii .
nob: Jeg forsto hva en fremmed sa .

source: Lei oba erenoamáš vásáhus munnje .
nob: Det var en forunderlig opplevelse .

source: Ipmirdin ahte galgen vuolgit dan skuvlii mii oidnui govain ja galgen oahppat lohkat ja čállit ollu eará mánáiguin ovttas .
nob: Jeg forsto at jeg skulle reise til den skolen på bildene for å lære meg å lese og skrive sammen med mange andre barn .

source: Son hárddašii mu ja muitalii ahte jos in lean siivui , de gal oahpaheaddji cikcii mu bealljái .
nob: Men for å erte meg fortalte hun at hvis jeg ikke var lydig kom lærerne til å klype meg i øreflippene .

source: In diehtán leaččai go duohta ja imaštallen sakka , eai hal mus lean goit bealljelasttat .
nob: Jeg visste ikke om det var sant og undret meg mye , for jeg hadde ikke øreflipper .

source: Son lei áidna olmmoš mu eallimis gii lei dadjan ahte son lei maiddái dakkár go mun .
nob: Hun var den eneste jeg hadde møtt i mitt liv som sa at hun var lik meg .

source: Soiten vuosttaš Guovdageain-olmmoš gii sáddejuvvojin bealjehemiid skuvlii .
nob: Jeg var kanskje den første fra Kautokeino som ble sendt til døveskole .

source: Maŋŋil sáddejuvvui Anders Buljo maiddái bealjehemiid skuvlii .
nob: Senere ble Anders Buljo også sendt til døveskolen .

source: Son lei dalle 15-jahkásaš .
nob: Han var på det tidspunktet 15 år .

source: Mu mielas dat lea imaš .
nob: Jeg synes det er merkelig .

source: Maŋŋil sáddejedje su Andebuai [ 1 ] vissa danne go son ii « hupman » .
nob: Men han ble senere sendt til Andebu [ 3 ] for han « pratet » visst ikke .

source: Mu mielas ii lean dat vuoiggalaš , oaivvildan dat lei boasttu báiki sutnje .
nob: Det synes jeg var urettferdig og mener det var en feilplassering .

source: Son čalmmehuvai maŋŋil , máhcai fas ruoktot ja orrugođii iežas olbmuid hálddus .
nob: Senere ble han blind , kom hjem og ble værende hos sin familie .

source: Son lei čeahpes bargi , muhto ii son hupman .
nob: Han var dyktig å jobbe , men snakket ikke .

source: In dieđe manne leaččai šaddan dakkárin .
nob: Hva som gjorde at det ble slik , det vet jeg ikke .

source: Lihkus mun bessen Romsii iskkademiide ja dasto bealjehemiid skuvlii ovdal go son , eadnán dat rábidii mu dohko .
nob: Heldigvis kom jeg til Tromsø til undersøkelse og senere til døveskolen tidligere enn han , takket være min mor .

source: Guhkes mátki Troandimii
nob: Lang reise til Trondheim

source: Ja de šattai nu ahte Anders Pentha doalvvui mu heastasáhtuin Áltái .
nob: Så ble det slik at Anders Pentha ordnet med hesteskyss til Alta .

source: Ii dalle lean biilasáhttu .
nob: Det var jo ikke bilskyss den gangen .

source: Sus lei oapmedállu ja heasta ja doaivvun son lei dušše 20 jahkásaš .
nob: Han hadde bondegård med hest og var bare 20 år tror jeg .

source: Astrid Solberg , gii lei buohccedikšu ja Stavangeris eret , lei vuolgime Romssa gávpogii ja ofelasttii mu .
nob: Astrid Solberg , som var sykepleier fra Stavanger , skulle reise til Tromsø og fulgte meg på veien .

source: Lei guhkes mátki .
nob: Det var en lang reise .

source: Idjadeimme Álttás ja doppe oidnen soađi .
nob: Vi overnattet i Alta og der fikk jeg se krigen .

source: In diehtán soahti dat lei , ii ge mus lean dasa mihkkege ipmárdusaid .
nob: Jeg visste ikke det var krig og hadde heller ingen begreper om hva det var .

source: Oidnen soalddáhiid boahtime .
nob: Jeg bare så soldater komme .

source: Moai buohccedikšuin leimme vázzime go fáhkkestaga báládii munno maŋábealde .
nob: Sykepleieren og jeg var ute og gikk og plutselig så tutet det bak oss .

source: Lei vissa hirbmat rigearra , muhto mun in gullan das maidege .
nob: Det var nok et skikkelig rabalder , men jeg hørte ingenting .

source: Son gaikkihii mu doaresbeallái .
nob: Hun røsket meg til siden .

source: Livččen sáhttán vuojahallat jámas !
nob: Jeg kunne ha blitt drept !

source: Soalddáhat orro suhttan hirbmadit ja mun suorganin .
nob: Soldatene så veldig sinte ut og jeg ble veldig redd .

source: Lástabiillat bohte maŋŋemaŋŋálaga , in lean oaidnán dakkáriid ovdal .
nob: De kom i lastebiler på lastebiler og slikt hadde jeg ikke sett før .

source: Golle guokte beaivvi , ja de vulggiime lulás fatnasa mielde .
nob: Etter to dager dro vi med båt sørover .

source: Manadettiin čuovvolii munno olmmái gii lei bargan máŋga jagi Finnmárkkus ja lei dál manname ruoktot .
nob: På turen videre fikk vi følge av en mann som hadde jobbet i Finnmark i mange år og skulle reise hjem .

source: Son lei kristiansandalaš , lei leamaš min olbmuid luhtte duoddaris ja dovddai mu váhnenguovtto .
nob: Han var fra Kristiansand og hadde vært hos oss på fjellet , så mine foreldre kjente han .

source: Doaivvun son snihkkii viesuid , muhto orun muitime su leamaš Sámemiššovnnas maiddái .
nob: Jeg tror han snekret hus , men jeg synes også å huske at han var i Samemisjonen .

source: Muittán su vuohččan go bođii min lávvui .
nob: Jeg husker første gang han kom til lavvuen .

source: Sus ledje ártegis gárvvut , lei hui stuoris , mun gávken sutnje ja imaštallen gii son die ges lea .
nob: Han hadde rare klær , var veldig høy og jeg glante selvfølgelig og lurte på hvem han var .

source: In diehtán gii son lei , muhto maŋŋil lean gullan ahte son lei Adolf ja lei bealjehemiid skuvlla oahpaheaddji fru Brekke vilbealli .
nob: Jeg ante ikke hva han het , men har fått vite senere at det var Adolf , som var søskenbarn til fru Brekke som var lærer på døveskolen .

source: Fanas manai Romssa gávpogii in ge mun diehtán ahte Adolf dat galggai mu ofelažžan bealjehemiid skuvlii .
nob: Båten gikk til Tromsø og jeg visste ikke at det var Adolf som skulle følge meg resten av turen til døveskolen .

source: Buohccedikšu bázii Romssa gávpogii , ja mun šadden viidáseappot dan ádjá mielde .
nob: Sykepleieren gikk av i Tromsø og jeg var nødt å reise videre med mannen alene .

source: Muittán ledjen hui bahámielas ja jeagoheapmi .
nob: Jeg husker at jeg var veldig sur og tverr .

source: In áigon earránaddat buohccedikšuin .
nob: Jeg ville ikke skilles fra sykepleieren .

source: In diehtán gosa galgen ja su mielde goit ledjen oadjebas .
nob: Jeg visste ikke hvor jeg skulle og hun var den som jeg var trygg på .

source: Dovden su boarrásiidruovttu rájes .
nob: Jeg kjente henne fra gamlehjemmet .

source: Muhtun oasážiid mátkkis lulás maid muittán lea go fuomášin fatnasa mas lei hui ártegis suovvabohcci .
nob: Små glimt som jeg husker av turen videre var at jeg ble oppmerksom på en båt med et merkelig rør .

source: Adolf čájehii gieđaiguin ahte dat bávkkehii ja muhtun fanas vuojui .
nob: Adolf viste med tegn at det eksploderte og at en båt sank .

source: Ipmirdin ahte juoga billistii nu go vielljan bissu .
nob: Jeg forsto at det var noe som ødela slik som min brors gevær .

source: Kanovnna mun ledjen oaidnán .
nob: Det var en kanon jeg hadde sett .

source: Muittán go čirron ollu lulás manadettiin .
nob: Jeg husker også at jeg gråt mye på turen sørover .

source: Fatnasis ledje dievva duiskalaččat , ja sii vigge stoagáidahttit mu .
nob: Båten var full av tyskere og de prøvde å leke med meg .

source: Muittán go sii govvejedje mu ja ožžon ruđa ja šuhkoláde .
nob: Jeg husker de tok bilder og jeg fikk penger og sjokolade .

source: Sii jeđđejedje mu nu bures go sáhtte ja ledje siivvut , muhto go olliimet Troandimii , de gal sin ámadajut rivde .
nob: De trøstet meg så godt de kunne og var snille . Men da vi kom frem til Trondheim endret ansiktene deres seg .

source: Sii šadde bahát ja garrasat .
nob: De ble strenge og avvisende .

source: Go ipmirdin ahte dál galgen gáddái , de čirron .
nob: Da jeg forsto at jeg skulle av båten , gråt jeg igjen .

source: Adolf geahččalii čilget munnje ahte deike mun galgen skuvlii , muhto mun in gillen šat ipmirdit .
nob: Adolf prøvde nok å forklare at det var hit jeg skulle for å gå på skole , men jeg orket ikke forstå .

source: Maŋážassii vuollánin ja vulgen su mielde .
nob: Etter hvert resignerte jeg og fulgte med ham .

source: Mu vuosttaš muitogovva doppe lea soahti , duiskalaččat ja go buot lei bombejuvvon ja billahuvvan .
nob: Mitt første inntrykk var krigen , tyskerne og alt som var bombet og ødelagt .

source: Oidnen soalddáhiid vázzime gáhtaid mielde .
nob: Jeg så soldater marsjere i gatene .

source: Doppe ledje soahtefatnasat , ollu rigearra ja mu mielas lei dat hui unohas .
nob: Det var krigsskip , mye støy og jeg opplevde det som ubehagelig .

source: Ii mus lean obage ipmárdus soađis , buorelihkus .
nob: Jeg hadde ikke begrep om krig og heldigvis for det .

source: In ipmirdan ahte duiskalaččat goddaledje olbmuid .
nob: Jeg var vel litt dum . Jeg forsto ikke at tyskerne drepte .

source: Troandima bealjehemiid skuvla lei dán visttis 1855-1991 .
nob: Døveskolen i Trondheim holdt til i dette bygget 1855-1991 .

source: Dál lea ee. Norgga bealjehemiidmusea dás .
nob: Nå er bl.a. Norsk Døvemuseum her .

source: ( Govva : Norsk Døvemuseum )
nob: ( Foto : Norsk Døvemuseum )

source: Bealjehemiid skuvlla oađđinsála , govviduvvon su . 1938 .
nob: Sovesalen på døveskolen , bildet er tatt ca. 1938

source: ( Govva : Trøndelag Folkemuseum / Schrøderarkivet )
nob: ( Foto : Trøndelag Folkemuseum / Schrøderarkivet )

source: Easka de ipmirdin ahte ledjen bealjeheapmi
nob: Først da skjønte jeg at jeg var døv

source: Manaime trihka mielde bealjehemiid skuvlii .
nob: Vi tok trikken til døveskolen .

source: Dat maid muittán das , lea go oahpaheaddji bođii ovddal , su namma lei fru Hansen .
nob: Det jeg husker av mitt møte med døveskolen var at vi ble mottatt av en lærer som het fru Hansen .

source: Son moddjái , spežžii gieđaidis oktii ja dollii mu birra .
nob: Hun smilte , klappet hendene sammen og ga meg en skikkelig klem .

source: Mu mielas lei hui ártet .
nob: Det syntes jeg var rart .

source: In dal mun goit dovdan su .
nob: Jeg kjente jo henne ikke .

source: Son dollii mu gihtii ja láidii mu muhtun latnjii .
nob: Hun tok meg i hånden og leide meg inn i et rom .

source: Doppe ledje máŋga oahppi , ja sii gávke munnje .
nob: Der var det flere elever og de niglodde på meg .

source: Buoremusat muittán go buohkat doppe hupme giehtagiela .
nob: Men mest av alt så brukte de tegn over alt .

source: De easka ipmirdin ahte ledjen bealjeheapmi , ja earát ledje maiddái dakkárat .
nob: Først da skjønte jeg at jeg var døv og at det var flere som var det .

source: Áddejin ahte min joavkku olbmot dat ledje geahččalan munnje muitalit dan – go ledje coggalan čuvddiideaset bealjeráigái ja bárdán oaivvi .
nob: Det gikk også opp for meg at det var det min familie hadde prøvd å fortelle meg når de puttet pekefingrene i ørene og ristet på hodet .

source: In lean rievtti mielde goassege ipmirdan mii dat lei .
nob: Jeg hadde jo egentlig aldri skjønt hva det betydde .

source: Dáppe dadje oahppit : – Leat go bealjeheapmi ?
nob: Her sa elevene ; – er du døv ?

source: – Humat go giehtagiela ?
nob: – bruker du tegn ?

source: De bođii bearráigeahčči fru Sæter .
nob: Så kom inspektør fru Sæter .

source: Son dajai munnje giehtagillii : – Don – boađe – borrat .
nob: Hun sa til meg med tegn : Du – komme – spise .

source: Moai manaime boradanlatnjii .
nob: Vi gikk inn til spisesalen .

source: Doppe lei váfis áhkku , su namma lei fru Iversen ja son lei hui garas .
nob: Der var det en frodig husmor som het fru Iversen og hun var streng .

source: In luohttán sutnje áibbas .
nob: Jeg ble litt skeptisk til henne .

source: Son lei finnmárkolaš , gullen maŋŋil .
nob: Hun var fra Finnmark , fikk jeg vite senere .

source: Go leimmet boradan , de vácciimet bajás moadde láhttegearddi ja skuvlalatnjii .
nob: Da vi hadde spist gikk vi opp noen etasjer og inn i et klasserom .

source: Oahpaheaddjin dan diimmus lei fru Brekke , ja mun galgen oahppat čállit naman .
nob: I den timen var det lærer fru Brekke som var tilstede og jeg skulle lære å skrive navnet mitt .

source: De gal seahkánin .
nob: Da ble jeg forvirret .

source: Dadjen mu namma lei Risten , muhto čállen Kristen , go nu ledjen oaidnán iežan nama čállon « K » dán skuvllas .
nob: Jeg sa jeg het Risten , men skrev Kristen for jeg hadde sett at navnet mitt begynte med « K » her på skolen .

source: – Ii , du namma lea Kirsten , dajai oahpaheaddji .
nob: – Nei , sa læreren , – du heter Kirsten !

source: Oahpaheaddji čilgii munnje ahte Kristen lea bártni namma , ja Kirsten lea nieidda namma .
nob: Læreren forklarte meg at Kristen var et guttenavn og Kirsten var et jentenavn .

source: Maŋŋil lean ipmirdan ahte son ii lean ipmirdan ahte mun geahččalin dadjat Risten , nu go ledjen oahppan ruovttus .
nob: Senere så har jeg forstått at hun hadde ikke skjønt at jeg prøvde å si Risten slik jeg hadde lært hjemme på fjellet .

source: Maid ba hal son diđii ge sámi birra ?
nob: Hva visste vel hun om samisk ?

source: Dohkkehin dan maid oahpaheaddji dajai ja čálligohten Kirsten .
nob: Jeg godtok hva læreren sa og skrev Kirsten for ettertiden .

source: Ja nu hal lei ge čállon mu báhpiriidda .
nob: Og det var jo det som sto i papirene mine .

source: Dat eahpečielggasvuohta ii čielgan goassege dan áiggis go vázzen skuvlla doppe .
nob: Men forvirringen ble aldri oppklart mens jeg gikk på skolen .

source: Easka maŋŋil , ollesolmmožin lean ipmirdan manne nu šattai .
nob: Først senere som voksen har jeg skjønt hvorfor det ble slik .

source: Go Adolf vulggii fas , de šadden hui eahpádussii , muhto doppe ledje mánát geaiguin stohken , ja ohppen jođánit giehtagiela – manai bures .
nob: Da Adolf reiste ble jeg veldig usikker , men det var barn å leke med og jeg lærte fort tegnspråk , – så det gikk bra .

source: Ja ohppen maiddái cealkit sániid ja ohppen hupmat dárogiela , iešguđetlágan dávviriin ledje gusto sánit ja namat .
nob: Og jeg fikk artikulasjonstrening og lærte å prate på norsk , vel det var ord og navn på forskjellige ting .

source: Guovdageainnu skuvlastivrra vuorká 1943
nob: Kautokeino skolestyres arkiv 1943 Ref .

source: Risten Sara árvosánit Bealjehemiid skuvllas pr. 18/12-43
nob: av Risten Saras karakterer ved Døveskolen pr. 18/12-43

source: Gávcci jagi internáhtas
nob: Åtte år på internatet

source: Orron bealjehemiid skuvlla internáhtas Troandimis gávcci jagi .
nob: Jeg bodde på internat på døveskolen i Trondheim i åtte år .

source: Doppe ožžon ustibiid ja mus lei buorre dilli .
nob: Der fikk jeg venner og hadde det bra .

source: Lokten áiggi bures .
nob: Jeg trivdes godt .

source: Ii oktage hárdán mu danne go ledjen sápmelaš dehe eará dihte .
nob: Det var ingen som mobbet meg for at jeg var samisk eller noe slikt .

source: Ohppiid gaskkas lei buorre biras .
nob: Det var et godt miljø blant elevene .

source: Áibbas hárdima haga goitge ii lean .
nob: Men helt fri for mobbing var det ikke .

source: Eará oahppit hárde muhtun Harstada nieiddaža go sus lei sámi hápmi .
nob: Det var en jente fra Harstad som noen elever mente så samisk ut og de terget henne for det .

source: Nieiddaš čierui ja dajai mus lei lihkku go ii lean sámi hápmi eai ge hárdán mu .
nob: Da gråt hun og pleide å si at jeg var heldig som ikke hadde samiske trekk så jeg slapp å bli mobbet .

source: Maid son dainna oaivvildii ?
nob: Hva nå det skulle bety ?

source: Soittii ieš sápmelaš .
nob: Hun var vel kanskje samisk .

source: Bealjehemiid skuvlla oahppit nektet « Ruksesgahpir ja gumpe » .
nob: Elever på døveskolen spiller " Rødhette og ulven " .

source: Kirsten Sara lea nr. 3 gurut bealde .
nob: Kirsten Sara er nr. 3 fra venstre foran .

source: Olgeš bealde lea Sigurd Ottar Ørsnes , geainna maŋŋil náitalii .
nob: Helt til høyre i bildet er Sigurd Ottar Ørsnes , som hun seinere gifta seg med .

source: Unnán oktavuohta ruovttuin
nob: Lite kontakt med familien

source: Ii oktage min joavkkus boahtán Troandimii geahččat mot muinna lea bealjehemiid skuvllas .
nob: Ingen i familien kom til Trondheim og så hvordan jeg hadde det på døveskolen .

source: Eadnán ii fitnan goassege doppe , ii mu konfirmašuvnnain ge .
nob: Min mor var aldri der , heller ikke til min konfirmasjon .

source: Ollu eará oahppit ožžo skeaŋkkaid , muhto munnje ii boahtán ruovttus ii mihkkege .
nob: Flere andre elever fikk gaver , men det kom ingenting hjemmefra til meg .

source: Eai skuvllas hupman goassege dan birra .
nob: Det var aldri snakk om det på skolen .

source: In vel juovllaide ge ožžon skeaŋkka .
nob: Heller ikke til jul var det gave .

source: Muhtumin ožžon čikŋahearvva oahpaheaddjis .
nob: Men jeg fikk et smykke fra en lærer engang .

source: Muhtun eará oahppi ii ge ožžon maidege ruovttus , ja son maiddái oaččui juoidá dan oahpaheaddjis .
nob: Det var en elev til som heller ikke fikk gaver hjemmefra og som fikk noe fra den samme læreren .

source: Oahpaheaddji mielas leimme moai várra nu heajut , muhto ii hal mis lean dakkár vierru attašit skeaŋkkaid dainna lágiin .
nob: Hun syntes vel synd på oss , men det var ikke tradisjon for oss å gi gaver på den måten .

source: Bohten internáhttii go ledjen ovcci – logi jahkásaš ja orron doppe dassážii go ledjen 17-jahkásaš .
nob: Jeg kom til internatet da jeg var ni – ti år og bodde der til jeg var 17 år .

source: Dan gaskkas oidnen iežamet joavkku olbmuid geasseluomus .
nob: På den tiden hadde jeg kontakt med familien min i sommerferien .

source: Muđui reivvestalaimet .
nob: Resten av året var kontakten via brev .

source: Oddmund Sandvik , gii orui Siebes , máhtii dárogiela , veahkehii eatnán čállit .
nob: Oddmund Sandvik , som bodde i Siebe , kunne norsk , så han hjalp mor å skrive .

source: Eadnán lei čeahppi čállit , ja Oddmund sáddii munnje reivve duollet dálle .
nob: Min bror var flink til å skrive og han sendte brev til meg av og til .

source: Eará fulkkiin maiddái ožžon reivviid .
nob: Dessuten fikk jeg også brev fra andre slektninger .

source: Lei suohtas reivvestallat , ja nu mii gulahalaimet čuovvovaš jagiid .
nob: Det var moro å brevveksle og på den måten holdt vi kontakt gjennom årene .

source: Mus lea ain áimmuin vuosttaš juovlakoarta man ožžon .
nob: Jeg har fremdeles gjemt på det første julekortet jeg fikk .

source: Dasa lei čállon « God Jul » čáppa giehtačállagiin .
nob: Der sto det « God Jul » med en pen håndskrift .

source: Ožžon dan 1940:s , ja lean álo vurkkodan dan dego hui divrras dávvira .
nob: Jeg fikk det i 1940 og jeg har gjemt det som en skatt .

source: Go šattai geasseluopmu , de lávejin vuolgit Návutnii .
nob: Når det ble sommerferie , reiste jeg til Kvænangen .

source: Doppe orron biebmováhnemiid luhtte dassážii go mu váhnemat bođiige viežžat mu .
nob: Der bodde jeg hos pleieforeldre til mine foreldre kunne komme og hente meg .

source: Juovllaide ja beassážiidda gal in beassan vuolgit ruoktot .
nob: Men til jul eller påske var det ingen hjemreise .

source: Eai dasa lean ruđat .
nob: Det var ikke penger til den slags .

source: Eadni lávii sáddet munnje ruđa dalle go vázzen bealjehemiid skuvlla , ii mus váilon mihkkege .
nob: Man ble på døveskolen . Mor sendte penger til meg den tiden jeg gikk på skolen , så jeg manglet ingenting .

source: Lávii nu ahte go vulggiimet ruoktot lupmui , de vulggiimet fárrolaga buohkat geat galggaimet davás fatnasa mielde , ja bealjehemiid skuvlla bargi lei ofelažžan .
nob: Det var slik at når vi reiste hjem på ferie dro alle som skulle med båt nordover sammen i følge med en fra døveskolen .

source: Dađistaga go fanas ain gáddánii kájáid lusa , de bohte muhtumat ohppiid ovddal , juogo fuolkkit dehe earát .
nob: Etter hvert som båten la til kaiene sto det alltid noen som fulgte elevene videre , enten familie eller noen andre .

source: Go fanas ollii gáddái dohko gosa mun galgen , de bođiiga biebmováhnemat viežžat mu .
nob: Så når båten la til kai der jeg skulle av , kom pleieforeldrene mine og hentet meg .

source: Sugaimet ruoktot ihkku .
nob: Vi rodde natta hjem .

source: Eai dalle lean dat oallut fievrrut ja sáhtut , eai soahteáigge goit .
nob: Det var jo lite med transportmidler den gang og i alle fall under krigen .

source: Soai suvddiiga mu vuosttaš oasi mátkkis , de idjadit ja de báikkálaš fatnasa mielde Romssa gávpogii .
nob: Samme når vi skulle tilbake . Jeg ble rodd det første stykket , så en overnatting og lokalbåt til Tromsø .

source: Doppe dan stuora johtilisfatnasa mielde lei bealjehemiid bargi min ofelažžan .
nob: Deretter på den store hurtigruta hvor det var en fra døveskolen som reiste sammen med alle elevene .

source: Sihke Harstadas ja Bodeajjus bohte oahppit fatnasii , ja eará mearragátte báikkiin guvlui .
nob: Det kom på elever både i Harstad og Bodø samt andre steder nedover kysten .

source: Mu biebmováhnen guovttos Návuonas leigga siivvut , muhto garrasat muinna .
nob: Mine pleieforeldre i Kvænangen var snille , men strenge .

source: Mun duođalaččat áktejin sudno .
nob: Jeg hadde veldig respekt for dem.

source: Maŋŋil , go vulgen fas bealjehemiid skuvlii , de čuovui sudno boarráseamos bárdni Reidar mu .
nob: Senere når jeg skulle tilbake til døveskolen , ble jeg fulgt av Reidar Johansen . som var eldste sønn i huset .

source: Son lei 23–24-jahkásaš dalle .
nob: Han var 23–24 år den gangen .

source: Son rábidii buot mu ovddas ja ráhkkanii munnje veahkkin .
nob: Han tok godt vare på meg og ordnet opp når jeg skulle reise .

source: Moai gulahalaime čálašemiin báberbihtáide .
nob: Vi kommuniserte ved å prate og skrive lapper .

source: Lean hui giitevaš sutnje .
nob: Jeg har mye å takke ham for .

source: Biebmojoavku ledje fal min verddet .
nob: Pleiefamilien var nok en « verdefamilie » [ 4 ] for oss .

source: Čájehuvvojin gávttiin
nob: Vist fram i samekofte

source: – Livččii ollu muitaleamoš skuvlaáiggis , muhto muittán erenoamážit čielgasit cealkin- ja bavssaipmirdandiimmu vuosttaš klássas .
nob: – Det er mye jeg kan trekke fram fra skoletiden , men jeg husker spesielt en artikulasjons- og munnavlesningstime i første klasse .

source: Rektor Beyer bođii diibmui , geahčastii munnje ja dajai : – Leat go don guovdageaidnulaš ?
nob: Rektor Beyer kom inn i timen , så på meg og spurte : Er du fra Kautokeino ?

source: Mun nivkalin .
nob: Jeg nikket .

source: Ipmirdin sáni « Kautokeino » .
nob: Jeg hadde oppfattet ordet Kautokeino .

source: De son bođii mu lusa , dollii mu gihtii ja dajai « god dag » .
nob: Så kom han bort til meg , tok meg i handa og sa « god dag » .
